  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/more-sites/build` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/ef85eb7c-28e5-492b-b145-bfcb21846da3/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

# module.eastus2-vms[0].azurerm_linux_virtual_machine.vm will be updated in-place
~ resource "azurerm_linux_virtual_machine" "vm" {
      id                              = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/eastus2-vm-0"
      name                            = "eastus2-vm-0"
      tags                            = {}
      # (21 unchanged attributes hidden)

    ~ boot_diagnostics {
        + storage_account_uri = "https://diag5d0412a820a54eb5.blob.core.windows.net/"
      }

      # (3 unchanged blocks hidden)
  }

# module.eastus2-vms[0].azurerm_network_interface.nic will be updated in-place
~ resource "azurerm_network_interface" "nic" {
      id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/eastus2-vm-0-nic"
      name                          = "eastus2-vm-0-nic"
      tags                          = {}
      # (11 unchanged attributes hidden)

    ~ ip_configuration {
          name                          = "internal"
        + public_ip_address_id          = (known after apply)
          # (5 unchanged attributes hidden)
      }
  }

# module.eastus2-vms[0].azurerm_network_interface_security_group_association.nsg_association will be created
+ resource "azurerm_network_interface_security_group_association" "nsg_association" {
    + id                        = (known after apply)
    + network_interface_id      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/eastus2-vm-0-nic"
    + network_security_group_id = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/eastus2-vm-0-nsg"
  }

# module.eastus2-vms[0].azurerm_public_ip.public_ip[0] will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "eastus2"
    + name                    = "eastus2-vm-0-public-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

# module.westus2-vms[0].azurerm_linux_virtual_machine.vm will be updated in-place
~ resource "azurerm_linux_virtual_machine" "vm" {
      id                              = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/westus2-vm-0"
      name                            = "westus2-vm-0"
      tags                            = {}
      # (21 unchanged attributes hidden)

    ~ boot_diagnostics {
        + storage_account_uri = "https://diag568ee10db602c5c2.blob.core.windows.net/"
      }

      # (3 unchanged blocks hidden)
  }

# module.westus2-vms[0].azurerm_network_interface.nic will be updated in-place
~ resource "azurerm_network_interface" "nic" {
      id                            = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/westus2-vm-0-nic"
      name                          = "westus2-vm-0-nic"
      tags                          = {}
      # (11 unchanged attributes hidden)

    ~ ip_configuration {
          name                          = "internal"
        + public_ip_address_id          = (known after apply)
          # (5 unchanged attributes hidden)
      }
  }

# module.westus2-vms[0].azurerm_network_interface_security_group_association.nsg_association will be created
+ resource "azurerm_network_interface_security_group_association" "nsg_association" {
    + id                        = (known after apply)
    + network_interface_id      = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/westus2-vm-0-nic"
    + network_security_group_id = "/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/westus2-vm-0-nsg"
  }

# module.westus2-vms[0].azurerm_public_ip.public_ip[0] will be created
+ resource "azurerm_public_ip" "public_ip" {
    + allocation_method       = "Static"
    + fqdn                    = (known after apply)
    + id                      = (known after apply)
    + idle_timeout_in_minutes = 4
    + ip_address              = (known after apply)
    + ip_version              = "IPv4"
    + location                = "westus2"
    + name                    = "westus2-vm-0-public-ip"
    + resource_group_name     = "org-jcetina-repo-baklava-rg"
    + sku                     = "Standard"
    + sku_tier                = "Regional"
    + zones                   = [
        + "1",
        + "2",
        + "3",
      ]
  }

Plan: 4 to add, 4 to change, 0 to destroy.
module.eastus2-vms[0].azurerm_public_ip.public_ip[0]: Creating...
module.westus2-vms[0].azurerm_public_ip.public_ip[0]: Creating...
module.eastus2-vms[0].azurerm_public_ip.public_ip[0]: Creation complete after 4s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/eastus2-vm-0-public-ip]
module.eastus2-vms[0].azurerm_network_interface.nic: Modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/eastus2-vm-0-nic]
module.westus2-vms[0].azurerm_public_ip.public_ip[0]: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/publicIPAddresses/westus2-vm-0-public-ip]
module.westus2-vms[0].azurerm_network_interface.nic: Modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/westus2-vm-0-nic]
module.eastus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/eastus2-vm-0-nic, 10s elapsed]
module.westus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/westus2-vm-0-nic, 10s elapsed]
module.eastus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/eastus2-vm-0-nic, 20s elapsed]
module.westus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/westus2-vm-0-nic, 20s elapsed]
module.eastus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/eastus2-vm-0-nic, 30s elapsed]
module.westus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/westus2-vm-0-nic, 30s elapsed]
module.eastus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/eastus2-vm-0-nic, 40s elapsed]
module.westus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/westus2-vm-0-nic, 40s elapsed]
module.eastus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/eastus2-vm-0-nic, 50s elapsed]
module.westus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/westus2-vm-0-nic, 50s elapsed]
module.eastus2-vms[0].azurerm_network_interface.nic: Modifications complete after 58s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/eastus2-vm-0-nic]
module.eastus2-vms[0].azurerm_network_interface_security_group_association.nsg_association: Creating...
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/eastus2-vm-0]
module.westus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/westus2-vm-0-nic, 1m0s elapsed]
module.eastus2-vms[0].azurerm_network_interface_security_group_association.nsg_association: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/eastus2-vm-0-nic|/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/eastus2-vm-0-nsg]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...t.Compute/virtualMachines/eastus2-vm-0, 10s elapsed]
module.westus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/westus2-vm-0-nic, 1m10s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...t.Compute/virtualMachines/eastus2-vm-0, 20s elapsed]
module.westus2-vms[0].azurerm_network_interface.nic: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...ork/networkInterfaces/westus2-vm-0-nic, 1m20s elapsed]
module.westus2-vms[0].azurerm_network_interface.nic: Modifications complete after 1m26s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/westus2-vm-0-nic]
module.westus2-vms[0].azurerm_network_interface_security_group_association.nsg_association: Creating...
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/westus2-vm-0]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...t.Compute/virtualMachines/eastus2-vm-0, 30s elapsed]
module.eastus2-vms[0].azurerm_linux_virtual_machine.vm: Modifications complete after 32s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/eastus2-vm-0]
module.westus2-vms[0].azurerm_network_interface_security_group_association.nsg_association: Creation complete after 6s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkInterfaces/westus2-vm-0-nic|/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/networkSecurityGroups/westus2-vm-0-nsg]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...t.Compute/virtualMachines/westus2-vm-0, 10s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...t.Compute/virtualMachines/westus2-vm-0, 20s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Still modifying... [id=/subscriptions/ad3b85d9-1354-4383-a30c-...t.Compute/virtualMachines/westus2-vm-0, 30s elapsed]
module.westus2-vms[0].azurerm_linux_virtual_machine.vm: Modifications complete after 33s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Compute/virtualMachines/westus2-vm-0]

Apply complete! Resources: 4 added, 4 changed, 0 destroyed.
```

  </details>